IDEA StatiCa Open Model
BeamDataEc2.TypeOfSupportLeft Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of support on the left side
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public TypeOfSupportConditions TypeOfSupportLeft { get; set; }
Public Property TypeOfSupportLeft As TypeOfSupportConditions
	Get
	Set
public:
property TypeOfSupportConditions TypeOfSupportLeft {
	TypeOfSupportConditions get ();
	void set (TypeOfSupportConditions value);
}
Property Value
Type: TypeOfSupportConditions
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace